Revit 2026 API

# TabbedDialogExtensionOnOKAction Property

---

The ok handler.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TabbedDialogAction OnOKAction { get; }
```
```vb
Public ReadOnly Property OnOKAction As TabbedDialogAction
	Get
```
```cpp
public:
property TabbedDialogAction^ OnOKAction {
	TabbedDialogAction^ get ();
}
```
```fsharp
member OnOKAction : TabbedDialogAction with get
```

#### Property Value

TabbedDialogAction

This handler will be invoked when the "Ok" button in Revit options dialog is clicked.

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace